{
  "class_name": "Model",
  "config": {
    "name": "model_2",
    "layers": [
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            1,
            69
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "dense_5",
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": "float32",
          "units": 500,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_4",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_4",
          "trainable": true,
          "batch_input_shape": [
            null,
            1,
            69
          ],
          "dtype": "float32",
          "filters": 500,
          "kernel_size": [
            1
          ],
          "strides": [
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "dense_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_5",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_5",
          "trainable": true,
          "dtype": "float32",
          "filters": 1000,
          "kernel_size": [
            50
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_3",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_3",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 500,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv1d_6",
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_6",
          "trainable": true,
          "dtype": "float32",
          "filters": 500,
          "kernel_size": [
            10
          ],
          "strides": [
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv1d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_4",
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 500,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "average_pooling1d_2",
        "class_name": "AveragePooling1D",
        "config": {
          "name": "average_pooling1d_2",
          "trainable": true,
          "dtype": "float32",
          "strides": [
            10
          ],
          "pool_size": [
            10
          ],
          "padding": "same",
          "data_format": "channels_last"
        },
        "inbound_nodes": [
          [
            [
              "conv1d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_2",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_2",
          "trainable": true,
          "dtype": "float32",
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ],
            [
              "average_pooling1d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "lstm_4",
        "class_name": "LSTM",
        "config": {
          "name": "lstm_4",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "units": 1000,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.2,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "inbound_nodes": [
          [
            [
              "concatenate_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "dense_6",
        "class_name": "Dense",
        "config": {
          "name": "dense_6",
          "trainable": true,
          "dtype": "float32",
          "units": 50,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "lstm_4",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_2",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_6",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.3.1",
  "backend": "tensorflow"
}